<!doctype html>
<html>
<head>
  <title>{{ $video->ru_name }}@if ($video->year) ({{ $video->year }})@endif смотреть в HD онлайн</title>
  <link href="/favicon.ico" rel="shortcut icon">
  <meta charset="utf-8">
  <meta content="width=device-width, initial-scale=1" name="viewport" >
  <link rel="stylesheet" href="/share/share.min.css" />
  <style>
    body.dark { background-color: #0f0f0f; }
    body.dark .user-info, body.dark .user-info a, body.dark .footer a { color: #ffffff; }
    body.dark .player-info a, body.dark .player-info, body.dark .modal-wrapper .content { color: #ffffff; }
    body.dark .player-info svg { fill: #ffffff; }
    body.dark .theme-switcher svg { fill: #ffffff; }
    body.dark .player-info .top-info, body.dark .player-info .bottom-info, body.dark .modal-wrapper .content { background-color: #1a1a1a; }
    body.dark .player-info .links a { border-color: #333333; }
    body.dark .player-info .links a:hover, body.dark.not-mobile .player-info .share:hover { background-color: #333333; }
    body.dark.mobile .player-info .share:active { background-color: #333333; }

    body.white { background-color: #e8e8e8; }
    body.white .user-info, body.white .user-info a, body.white .footer a { color: #222222; }
    body.white .player-info a, body.white .player-info, body.white .modal-wrapper .content { color: #222222; }
    body.white .player-info svg { fill: #222222; }
    body.white .theme-switcher svg { fill: #222222; }
    body.white .player-info .top-info, body.white .player-info .bottom-info, body.white .modal-wrapper .content { background-color: #ffffff; }
    body.white .player-info .links a { border-color: #e6e6e6; }
    body.white .player-info .links a:hover, body.white.not-mobile .player-info .share:hover { background-color: #e6e6e6; }
    body.white.mobile .player-info .share:active { background-color: #e6e6e6; }
  </style>

  <meta property="og:url" content="https://{{ $serverDomain }}/share/{{ $id }}?tgc={{ $tgc }}">
  <meta property="og:type" content="website">
  <meta property="og:title" content="{{ $video->ru_name }}@if ($video->year) ({{ $video->year }})@endif смотреть в HD онлайн">
  <meta property="og:description" content="{{ $video->ru_name }}@if ($video->year) ({{ $video->year }})@endif смотреть онлайн бесплатно в хорошем качестве">
</head>
<body class="dark  not-mobile  ">
  <div class="theme-switcher">
    <div class="to-dark">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 312.999 312.999" width="100%" height="100%"><path d="M305.6 178.053c-3.2-.8-6.4 0-9.2 2-10.4 8.8-22.4 16-35.6 20.8-12.4 4.8-26 7.2-40.4 7.2-32.4 0-62-13.2-83.2-34.4-21.2-21.2-34.4-50.8-34.4-83.2 0-13.6 2.4-26.8 6.4-38.8 4.4-12.8 10.8-24.4 19.2-34.4 3.6-4.4 2.8-10.8-1.6-14.4-2.8-2-6-2.8-9.2-2-34 9.2-63.6 29.6-84.8 56.8-20.4 26.8-32.8 60-32.8 96.4 0 43.6 17.6 83.2 46.4 112s68.4 46.4 112 46.4c36.8 0 70.8-12.8 98-34 27.6-21.6 47.6-52.4 56-87.6 2-6-1.2-11.6-6.8-12.8zm-61.2 83.6c-23.2 18.4-52.8 29.6-85.2 29.6-38 0-72.4-15.6-97.2-40.4-24.8-24.8-40.4-59.2-40.4-97.2 0-31.6 10.4-60.4 28.4-83.6 12.4-16 28-29.2 46-38.4-2 4.4-4 8.8-5.6 13.6-5.2 14.4-7.6 29.6-7.6 45.6 0 38 15.6 72.8 40.4 97.6s59.6 40.4 97.6 40.4c16.8 0 32.8-2.8 47.6-8.4 5.2-2 10.4-4 15.2-6.4-9.6 18.4-22.8 34.8-39.2 47.6z" /></svg>
    </div>
    <div class="to-white">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 312.812 312.812" width="100%" height="100%"><path d="M305.2 178.159c-3.2-.8-6.4 0-9.2 2-10.4 8.8-22.4 16-35.6 20.8-12.4 4.8-26 7.2-40.4 7.2-32.4 0-62-13.2-83.2-34.4-21.2-21.2-34.4-50.8-34.4-83.2 0-13.6 2.4-26.8 6.4-38.8 4.4-12.8 10.8-24.4 19.2-34.4 3.6-4.4 2.8-10.8-1.6-14.4-2.8-2-6-2.8-9.2-2-34 9.2-63.6 29.6-84.8 56.8-20.4 26.8-32.4 60-32.4 96 0 43.6 17.6 83.2 46.4 112s68 46.4 112 46.4c36.8 0 70.8-12.8 98-34 27.6-21.6 47.6-52.4 56-87.6 1.6-5.6-1.6-11.2-7.2-12.4z" /></svg>
    </div>
  </div>

  <div class="main-wrapper">
    <div class="main">


      <div class="player-info">
        <div class="top-info">
          <div class="title">{{ $video->ru_name }}@if ($video->year) ({{ $video->year }})@endif</div>
          <div class="links">
            <a id="share">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 57.884 57.884" width="16" height="16"><path d="M46 37c-3 0-5.8 1.3-7.7 3.4l-16.6-8c.4-1 .6-2.2.6-3.5 0-1.3-.2-2.5-.6-3.6l16.6-8c2 2 4.6 3.5 7.7 3.5 5.7 0 10.4-4.8 10.4-10.6C56.4 4.7 51.7 0 46 0c-5.8 0-10.5 4.7-10.5 10.4 0 .6 0 1 .2 1.6L18 20.5c-1.7-1.2-3.8-2-6-2C6 18.5 1.4 23.2 1.4 29S6 39.3 12 39.3c2.2 0 4.3-.8 6-2l17.7 8.4-.2 1.7C35.5 53.2 40.2 58 46 58c5.7 0 10.4-4.8 10.4-10.5C56.4 41.7 51.7 37 46 37z" class="fill"></path></svg>
            </a>
          </div>
        </div>
        <div class="player">
            <iframe id="cdnhub" src="https://cdn0.futemaxlive.com/show/{{ $id }}?tgc={{ $tgc }}" frameborder="0" allowfullscreen allow="autoplay *; fullscreen *"></iframe>
        </div>
        <div class="bottom-info">
          <div></div>
          <div class="views">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 488.85 488.85">
              <path d="M244.425 98.725c-93.4 0-178.1 51.1-240.6 134.1-5.1 6.8-5.1 16.3 0 23.1 62.5 83.1 147.2 134.2 240.6 134.2s178.1-51.1 240.6-134.1c5.1-6.8 5.1-16.3 0-23.1-62.5-83.1-147.2-134.2-240.6-134.2zm6.7 248.3c-62 3.9-113.2-47.2-109.3-109.3 3.2-51.2 44.7-92.7 95.9-95.9 62-3.9 113.2 47.2 109.3 109.3-3.3 51.1-44.8 92.6-95.9 95.9zm-3.1-47.4c-33.4 2.1-61-25.4-58.8-58.8 1.7-27.6 24.1-49.9 51.7-51.7 33.4-2.1 61 25.4 58.8 58.8-1.8 27.7-24.2 50-51.7 51.7z"/>
            </svg>
            <span>{{ $views }}</span>
          </div>
        </div>
      </div>
    </div>
  </div>

  <div class="footer"><a id="contacts">Контакты / Получить такую же страницу</a></div>

  <div class="modal-wrapper" id="share-modal">
  <div class="content">
    <div class="close">
      <svg width="100%" height="100%" xmlns="http://www.w3.org/2000/svg"><path d="M10.592 9l7.078-7.078A1.125 1.125 0 1 0 16.078.33L9 7.408 1.922.33A1.125 1.125 0 1 0 .33 1.922L7.408 9 .33 16.078a1.125 1.125 0 1 0 1.592 1.591L9 10.591l7.078 7.078a1.122 1.122 0 0 0 1.592 0c.44-.439.44-1.152 0-1.591L10.592 9z" /></svg>
    </div>
    <div class="title">Поделиться</div>

    <div class="subtitle">Ссылка</div>
    <div class="link-input">
      <input readonly value="https://{{ $serverDomain }}/share/{{ $id }}?tgc={{ $tgc }}" />
      <div class="copy">
        <div class="copy-icon">
          <svg width="16" height="20" xmlns="http://www.w3.org/2000/svg"><path d="M10.868 3.495H1.58A1.58 1.58 0 0 0 0 5.075v13.327c0 .871.708 1.58 1.58 1.58h9.288a1.58 1.58 0 0 0 1.58-1.58V5.074a1.586 1.586 0 0 0-1.58-1.58zm.471 14.903a.475.475 0 0 1-.475.474H1.575a.475.475 0 0 1-.474-.474V5.074c0-.262.213-.475.474-.475h9.29c.261 0 .474.213.474.475v13.324z" /><path d="M14.42 0H5.133a1.58 1.58 0 0 0-1.58 1.58.55.55 0 0 0 .552.552.55.55 0 0 0 .553-.552c0-.262.213-.475.475-.475h9.289c.261 0 .474.213.474.475v13.327a.475.475 0 0 1-.474.475.55.55 0 0 0-.553.552.55.55 0 0 0 .553.553A1.58 1.58 0 0 0 16 14.907V1.58A1.58 1.58 0 0 0 14.42 0z" /></svg>
        </div>
        <div class="copied-icon">
          <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 510 510"><path d="M150.45 206.55l-35.7 35.7L229.5 357l255-255-35.7-35.7-219.3 219.3-79.05-79.05zM459 255c0 112.2-91.8 204-204 204S51 367.2 51 255 142.8 51 255 51c20.4 0 38.25 2.55 56.1 7.65l40.801-40.8C321.3 7.65 288.15 0 255 0 114.75 0 0 114.75 0 255s114.75 255 255 255 255-114.75 255-255h-51z" fill="#FFF"/></svg>
        </div>
      </div>
    </div>

    <div class="subtitle">Соцсети</div>
    <div class="social-links">
      <a class="vk" href="https://vk.com/share.php?url={{ $share }}&title={{ $title }}&image={{ $image }}" target="_blank">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 96.496 96.496"><path d="M92.499 65.178c-2.873-3.446-6.254-6.387-9.453-9.51-2.886-2.815-3.068-4.448-.748-7.697 2.532-3.546 5.255-6.956 7.81-10.486 2.385-3.299 4.823-6.589 6.078-10.539.796-2.513.092-3.623-2.485-4.063-.444-.077-.903-.081-1.355-.081l-15.289-.018c-1.883-.028-2.924.793-3.59 2.462-.899 2.256-1.826 4.51-2.897 6.687-2.43 4.936-5.144 9.707-8.949 13.747-.839.891-1.767 2.017-3.169 1.553-1.754-.64-2.271-3.53-2.242-4.507l-.015-17.647c-.34-2.521-.899-3.645-3.402-4.135l-15.882.003c-2.12 0-3.183.819-4.315 2.145-.653.766-.85 1.263.492 1.517 2.636.5 4.121 2.206 4.515 4.849.632 4.223.588 8.463.224 12.703-.107 1.238-.32 2.473-.811 3.629-.768 1.817-2.008 2.187-3.637 1.069-1.475-1.012-2.511-2.44-3.525-3.874-3.809-5.382-6.848-11.186-9.326-17.285-.716-1.762-1.951-2.83-3.818-2.859a389.727 389.727 0 0 0-13.762.004c-2.76.052-3.583 1.392-2.459 3.894 4.996 11.113 10.557 21.917 17.816 31.759 3.727 5.051 8.006 9.51 13.534 12.67 6.265 3.582 13.009 4.66 20.112 4.328 3.326-.156 4.325-1.021 4.479-4.336.104-2.268.361-4.523 1.48-6.561 1.098-2 2.761-2.381 4.678-1.137.959.623 1.767 1.416 2.53 2.252 1.872 2.048 3.677 4.158 5.62 6.137 2.437 2.48 5.324 3.945 8.954 3.646l14.052.003c2.264-.148 3.438-2.924 2.138-5.451-.913-1.77-2.111-3.346-3.383-4.871z"/></svg>
      </a>
      <a class="facebook" href="https://www.facebook.com/sharer.php?u={{ $share }}" target="_blank">
        <svg xmlns="http://www.w3.org/2000/svg" width="512" height="512" viewBox="0 0 96.227 96.227"><path d="M73.099 15.973l-9.058.004c-7.102 0-8.477 3.375-8.477 8.328v10.921h16.938l-.006 17.106H55.564v43.895H37.897V52.332h-14.77V35.226h14.77V22.612C37.897 7.972 46.84 0 59.9 0l13.2.021-.001 15.952z" fill="#FFF"/></svg>
      </a>
      <a class="twitter" href="https://twitter.com/share?url={{ $share }}&text={{ $title }}" target="_blank">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 97.637 97.637"><path d="M97.523 18.526a.482.482 0 0 0-.568-.131 39.055 39.055 0 0 1-9.153 2.776 20.299 20.299 0 0 0 7.143-10.035.484.484 0 0 0-.709-.565 39.147 39.147 0 0 1-12.18 4.701 20.408 20.408 0 0 0-14.644-6.219c-11.204 0-20.318 9.114-20.318 20.317 0 1.355.131 2.697.391 4-15.518-.958-30.028-8.408-39.894-20.509a.484.484 0 0 0-.795.062 20.303 20.303 0 0 0-2.751 10.215 20.3 20.3 0 0 0 7.649 15.896 19.42 19.42 0 0 1-7.089-2.292.483.483 0 0 0-.721.413l-.002.26c0 8.946 5.895 16.801 14.282 19.409a19.514 19.514 0 0 1-6.754-.098.486.486 0 0 0-.553.623A20.314 20.314 0 0 0 28.494 71.39c-6.785 4.971-14.805 7.59-23.279 7.59-1.561 0-3.133-.093-4.673-.274a.492.492 0 0 0-.514.317.485.485 0 0 0 .195.572 56.693 56.693 0 0 0 30.664 8.988c35.625 0 56.913-28.938 56.913-56.914 0-.779-.015-1.554-.046-2.327a40.519 40.519 0 0 0 9.802-10.235.486.486 0 0 0-.033-.581z"/></svg>
      </a>
      <a class="google-plus" href="https://plus.google.com/share?url={{ $share }}" target="_blank">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 96.669 96.669"><path d="M50.91 55.189l-4.533-3.522c-1.38-1.144-3.27-2.656-3.27-5.422 0-2.778 1.889-4.544 3.527-6.18 5.279-4.157 10.557-8.581 10.557-17.903 0-9.586-6.031-14.629-8.923-17.022h7.795L64.244 0H39.459C32.658 0 22.856 1.608 15.68 7.533c-5.408 4.666-8.046 11.099-8.046 16.892 0 9.831 7.548 19.798 20.88 19.798 1.259 0 2.636-.124 4.022-.252-.623 1.515-1.252 2.777-1.252 4.917 0 3.905 2.006 6.299 3.774 8.567-5.663.39-16.237 1.018-24.033 5.809-7.424 4.415-9.684 10.84-9.684 15.377 0 9.334 8.8 18.028 27.045 18.028 21.636 0 33.089-11.971 33.089-23.823.002-8.707-5.028-12.992-10.565-17.657zM34.431 40.691c-10.824 0-15.727-13.992-15.727-22.434 0-3.288.623-6.682 2.763-9.333C23.486 6.4 27 4.762 30.281 4.762c10.434 0 15.846 14.118 15.846 23.197 0 2.271-.251 6.296-3.144 9.207-2.023 2.021-5.409 3.525-8.552 3.525zm.124 50.696c-13.46 0-22.139-6.438-22.139-15.392 0-8.949 8.048-11.978 10.816-12.979 5.281-1.777 12.076-2.024 13.21-2.024 1.258 0 1.887 0 2.889.126 9.568 6.81 13.721 10.203 13.721 16.65.001 7.805-6.417 13.619-18.497 13.619zM82.679 40.499V27.894h-6.224v12.605H63.869v6.294h12.586v12.684h6.224V46.793h12.649v-6.294z"/></svg>
      </a>
      <a class="telegram" href="https://t.me/share/url?url={{ $share }}&text={{ $title }}" target="_blank">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 300 300" width="512" height="512"><path d="M5.299 144.645l69.126 25.8 26.756 86.047c1.712 5.511 8.451 7.548 12.924 3.891l38.532-31.412a11.496 11.496 0 0 1 14.013-.391l69.498 50.457c4.785 3.478 11.564.856 12.764-4.926L299.823 29.22c1.31-6.316-4.896-11.585-10.91-9.259L5.218 129.402c-7.001 2.7-6.94 12.612.081 15.243zm91.57 12.066l135.098-83.207c2.428-1.491 4.926 1.792 2.841 3.726L123.313 180.87a23.112 23.112 0 0 0-7.163 13.829l-3.798 28.146c-.503 3.758-5.782 4.131-6.819.494l-14.607-51.325c-1.673-5.854.765-12.107 5.943-15.303z" fill="#FFF"/></svg>
      </a>
      <a class="ok-ru" href="https://connect.ok.ru/offer?url={{ $share }}&title={{ $title }}&imageUrl={{ $image }}">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 95.481 95.481"><path d="M43.041 67.254c-7.402-.772-14.076-2.595-19.79-7.064-.709-.556-1.441-1.092-2.088-1.713-2.501-2.402-2.753-5.153-.774-7.988 1.693-2.426 4.535-3.075 7.489-1.682.572.27 1.117.607 1.639.969 10.649 7.317 25.278 7.519 35.967.329 1.059-.812 2.191-1.474 3.503-1.812 2.551-.655 4.93.282 6.299 2.514 1.564 2.549 1.544 5.037-.383 7.016-2.956 3.034-6.511 5.229-10.461 6.761-3.735 1.448-7.826 2.177-11.875 2.661.611.665.899.992 1.281 1.376 5.498 5.524 11.02 11.025 16.5 16.566 1.867 1.888 2.257 4.229 1.229 6.425-1.124 2.4-3.64 3.979-6.107 3.81-1.563-.108-2.782-.886-3.865-1.977-4.149-4.175-8.376-8.273-12.441-12.527-1.183-1.237-1.752-1.003-2.796.071-4.174 4.297-8.416 8.528-12.683 12.735-1.916 1.889-4.196 2.229-6.418 1.15-2.362-1.145-3.865-3.556-3.749-5.979.08-1.639.886-2.891 2.011-4.014 5.441-5.433 10.867-10.88 16.295-16.322.359-.362.694-.746 1.217-1.305z"/><path d="M47.55 48.329c-13.205-.045-24.033-10.992-23.956-24.218C23.67 10.739 34.505-.037 47.84 0c13.362.036 24.087 10.967 24.02 24.478-.068 13.199-10.971 23.897-24.31 23.851zm12.001-24.186c-.023-6.567-5.253-11.795-11.807-11.801-6.609-.007-11.886 5.316-11.835 11.943.049 6.542 5.324 11.733 11.896 11.709 6.552-.023 11.768-5.285 11.746-11.851z"/></svg>
      </a>
    </div>
  </div>
</div>
  <div class="modal-wrapper" id="contacts-modal">
  <div class="content">
    <div class="close">
      <svg width="100%" height="100%" xmlns="http://www.w3.org/2000/svg"><path d="M10.592 9l7.078-7.078A1.125 1.125 0 1 0 16.078.33L9 7.408 1.922.33A1.125 1.125 0 1 0 .33 1.922L7.408 9 .33 16.078a1.125 1.125 0 1 0 1.592 1.591L9 10.591l7.078 7.078a1.122 1.122 0 0 0 1.592 0c.44-.439.44-1.152 0-1.591L10.592 9z" /></svg>
    </div>
    <div class="title">Контакты</div>
    <div class="text">
      Если вы являетесь владельцем сообщества, паблика или канала в любой социальной сети или мессенджере, то вы можете получить доступ к созданию таких же страниц, как эта, для размещения плееров.
      <br><br>
      Также если вы являетесь владельцем сайта, то плееры можно брать отдельно от данной страницы и использовать их на своем сайте.
      <br><br>
      Для получения доступа напишите нам в телеграм <b>@cdnhub</b>
    </div>
    </div>
  </div>
</div>

  <script type="text/javascript" src="/share/share.min.js"></script>
  <script type="text/javascript" src="/actualize.js"></script>

</body>
</html>